InformationRegisters/СоответствиеТиповРозничныхТочекИТорговыхМарок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеТиповРозничныхТочекИТорговыхМарок</Name>
			<Comment>Соответствие типов розничных точек и торговых марок</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ТипРозничнойТочки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРозничныхТочек</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговаяМарка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеМарки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СоответствиеТиповРозничныхТочекИТорговыхМарок/Ext/ManagerModule.bsl
//+++АК KIRN 2018.02.20 ИП-00017976
//Истина - соответствует
//Ложь - не соответствует
Функция ПроверитьСоответствиеРозничнойТочкиИТорговойМарки(СтруктурнаяЕдиница, ТорговаяМарка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
				   |Выбрать Спр.ТипРозничнойТочки КАК ТипСЕ ПОМЕСТИТЬ вт ИЗ Справочник.СтруктурныеЕдиницы КАК Спр ГДЕ Спр.Ссылка = &СтруктурнаяЕдиница;
				   |////	
				   |ВЫБРАТЬ
	               |	СоответствиеТиповРозничныхТочекИТорговыхМарок.ТипРозничнойТочки,
	               |	СоответствиеТиповРозничныхТочекИТорговыхМарок.ТорговаяМарка
	               |ИЗ
	               |	РегистрСведений.СоответствиеТиповРозничныхТочекИТорговыхМарок КАК СоответствиеТиповРозничныхТочекИТорговыхМарок
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт ПО СоответствиеТиповРозничныхТочекИТорговыхМарок.ТипРозничнойТочки = вт.ТипСЕ
	               |ГДЕ
	               |	СоответствиеТиповРозничныхТочекИТорговыхМарок.ТорговаяМарка = &ТорговаяМарка";
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница",СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ТорговаяМарка", ТорговаяМарка);
	Результат = Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();		
КонецФункции
//---АК KIRN
